results = ['BTS', '블랙핑크', '뉴진스', 'BTS', '블랙핑크', 'GOT7', 'GOT7', '블랙핑크', '뉴진스', '뉴진스', 'BTS', '블랙핑크', 'GOT7', 'GOT7', '블랙핑크', '뉴진스', 'GOT7', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'GOT7', '몬스타엑스', '뉴진스', '뉴진스', 'BTS', '몬스타엑스', 'BTS', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '뉴진스', 'BTS', '블랙핑크', 'GOT7', 'GOT7', '블랙핑크', '뉴진스', 'GOT7', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'GOT7', '몬스타엑스', '뉴진스', '뉴진스', 'BTS', '몬스타엑스', 'BTS', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '뉴진스', 'BTS', 'EXO', '몬스타엑스', '뉴진스', 'BTS', '블랙핑크', 'GOT7', 'GOT7', '블랙핑크', '뉴진스', 'GOT7', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'GOT7', '몬스타엑스', '뉴진스', '뉴진스', 'BTS', '몬스타엑스', 'BTS', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '뉴진스', 'BTS', '블랙핑크', 'GOT7', 'GOT7', '블랙핑크', '뉴진스', 'GOT7', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'GOT7', '몬스타엑스', '뉴진스', '뉴진스', 'BTS', '몬스타엑스', 'BTS', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '뉴진스', 'BTS', 'EXO', '몬스타엑스', 'GOT7', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'GOT7', '몬스타엑스', '뉴진스', '뉴진스', 'BTS', '몬스타엑스', 'BTS', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '뉴진스', 'BTS', '블랙핑크', 'GOT7', 'GOT7', '블랙핑크', '뉴진스', 'GOT7', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'GOT7', '몬스타엑스', '뉴진스', '뉴진스', 'BTS', '몬스타엑스', 'BTS', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '몬스타엑스', 'EXO', 'EXO', '뉴진스', 'GOT7', '블랙핑크', '뉴진스', 'BTS', 'EXO', '몬스타엑스', '몬스타엑스', 'GOT7', 'EXO', 'EXO', 'GOT7', 'BTS', '블랙핑크', '몬스타엑스', 'EXO', 'GOT7', '세븐틴', 'BTS', '몬스타엑스', '블랙핑크', '뉴진스', '뉴진스', 'GOT7', 'BTS', '뉴진스', 'EXO', 'EXO', '블랙핑크']

# 총 응답자 수 출력 (힌트:9쪽)
print("이번 조사의 총 응답자 수: ", )

# 응답된 아이돌을 알파벳 또는 가나다 순서대로 추출(중복 없는 리스트로 출력) (힌트: 26쪽)
print('언급된 아이돌 명단은 아래와 같다')

print(idol_list)
# 각 아이돌 이름을 key로, 득표수를 value로 하는 dictionaty 출력 (힌트: 7쪽)
print('각 아이돌의 득표수는 아래와 같다.')


print(dict)

